components/mediation/mediation-library/connectors/org.wso2.carbon.connector.salesforce/src/main/resources/salesforce/logout.xml

<?xml version="1.0" encoding="UTF-8"?>
<template name="logout" xmlns="http://ws.apache.org/ns/synapse">
    <sequence>
        <header
            expression="get-property('operation','salesforce.serviceUrl')" name="To"/>
        <payloadFactory>
            <format>
                <soapenv:Envelope
                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
                    <soapenv:Header>
                        <urn:SessionHeader>
                            <urn:sessionId>$1</urn:sessionId>
                        </urn:SessionHeader>
                    </soapenv:Header>
                    <soapenv:Body>
                        <urn:query>
                            <urn:logout/>
                        </urn:query>
                    </soapenv:Body>
                </soapenv:Envelope>
            </format>
            <args>
                <arg expression="get-property('operation','salesforce.sessionId')"/>
            </args>
        </payloadFactory>
        <callout action="urn:partner.soap.sforce.com/Soap/logoutRequest">
            <source type="envelope"/>
            <target xmlns:ns="http://org.apache.synapse/xsd"
                xmlns:ns2="http://org.apache.synapse/xsd"
                xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"
                xmlns:s12="http://www.w3.org/2003/05/soap-envelope" xpath="s11:Body/child::*[fn:position()=1] | s12:Body/child::*[fn:position()=1]"/>
        </callout>
        <property name="salesforce.sessionId" scope="operation"
            type="STRING" value="" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property name="salesforce.serviceUrl" scope="operation"
            type="STRING" value="" xmlns:ns="urn:partner.soap.sforce.com"/>
        <property name="salesforce.login.done" scope="operation"
            type="STRING" value="false"/>
    </sequence>
</template>
